###############################################################
#  Generated by:      Cadence Encounter 13.10-p003_1
#  OS:                Linux x86_64(Host ID bluestar)
#  Generated on:      Mon Jun  2 12:36:22 2014
#  Design:            fpu
#  Command:           saveDesign fpu.enc
###############################################################
current_design fpu
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {gclk}]  -name clk1 -period 4.000000 -waveform {0.000000 2.000000}
set_clock_transition  -rise -max 0.1 [get_clocks {clk1}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk1}]
set_propagated_clock  [get_ports {gclk}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_rdy_px2}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[123]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[122]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[121]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[120]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[119]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[118]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[117]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[116]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[115]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[114]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[113]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[112]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[111]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[110]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[109]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[108]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[107]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[106]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[105]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[104]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[103]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[102]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[101]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[100]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[99]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[98]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[97]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[96]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[95]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[94]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[93]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[92]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[91]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[90]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[89]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[88]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[87]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[86]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[85]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[84]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[83]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[82]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[81]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[80]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[79]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[78]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[77]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[76]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[75]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[74]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[73]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[72]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[71]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[70]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[69]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[68]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[67]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[66]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[65]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[64]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[63]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[62]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[61]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[60]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[59]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[58]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[57]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[56]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[55]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[54]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[53]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[52]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[51]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[50]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[49]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[48]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[47]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[46]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[45]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[44]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[43]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[42]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[41]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[40]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[39]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[38]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[37]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[36]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[35]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[34]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[33]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[32]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[31]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[30]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[29]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[28]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[27]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[26]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[25]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[24]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[23]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[22]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[21]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[20]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[19]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[18]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[17]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[16]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[15]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[14]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[13]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[12]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[11]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[10]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[9]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[8]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[7]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[6]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[5]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[4]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[3]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[2]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[1]}]
set_input_transition 0.1  [get_ports {pcx_fpio_data_px2[0]}]
set_input_transition 0.1  [get_ports {arst_l}]
set_input_transition 0.1  [get_ports {grst_l}]
set_input_transition 0.1  [get_ports {gclk}]
set_input_transition 0.1  [get_ports {cluster_cken}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[7]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[6]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[5]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[4]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[3]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[2]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[1]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_req_cq[0]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[144]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[143]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[142]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[141]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[140]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[139]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[138]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[137]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[136]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[135]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[134]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[133]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[132]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[131]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[130]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[129]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[128]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[127]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[126]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[125]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[124]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[123]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[122]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[121]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[120]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[119]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[118]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[117]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[116]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[115]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[114]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[113]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[112]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[111]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[110]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[109]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[108]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[107]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[106]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[105]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[104]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[103]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[102]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[101]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[100]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[99]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[98]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[97]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[96]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[95]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[94]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[93]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[92]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[91]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[90]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[89]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[88]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[87]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[86]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[85]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[84]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[83]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[82]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[81]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[80]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[79]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[78]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[77]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[76]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[75]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[74]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[73]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[72]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[71]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[70]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[69]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[68]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[67]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[66]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[65]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[64]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[63]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[62]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[61]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[60]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[59]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[58]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[57]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[56]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[55]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[54]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[53]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[52]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[51]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[50]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[49]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[48]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[47]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[46]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[45]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[44]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[43]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[42]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[41]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[40]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[39]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[38]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[37]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[36]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[35]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[34]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[33]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[32]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[31]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[30]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[29]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[28]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[27]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[26]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[25]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[24]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[23]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[22]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[21]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[20]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[19]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[18]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[17]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[16]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[15]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[14]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[13]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[12]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[11]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[10]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[9]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[8]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[7]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[6]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[5]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[4]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[3]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[2]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[1]}]
set_load -pin_load -max  2  [get_ports {fp_cpx_data_ca[0]}]
set_input_transition 0.1  [get_ports {ctu_tst_pre_grst_l}]
set_input_transition 0.1  [get_ports {global_shift_enable}]
set_input_transition 0.1  [get_ports {ctu_tst_scan_disable}]
set_input_transition 0.1  [get_ports {ctu_tst_scanmode}]
set_input_transition 0.1  [get_ports {ctu_tst_macrotest}]
set_input_transition 0.1  [get_ports {ctu_tst_short_chain}]
set_input_transition 0.1  [get_ports {si}]
set_load -pin_load -max  2  [get_ports {so}]
set_wire_load_mode enclosed
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/LOGIC1_X1}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/LOGIC0_X1}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X32}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X16}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X8}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X4}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X2}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X1}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/ANTENNA_X1}]
